'use strict';
const shingyou =
    ['ぶっせつまーかー','はんにゃーはーらー','みーたーし～んぎょう～' ,
    'かんじーざいぼーさー','ぎょうじん','はんにゃーはーらーみーたー',
    'じーしょうけんごー','うんかいくーどー','いっさいくーやく',
    'しゃーりーしー','しきふーいーくう','くうふーいーしき',
    'しきそくぜーくう','くうそくぜーしき','じゅーそうぎょうしき','やくぶーにょーぜー',
    'しゃーりーしー','ぜーしょうほうくうそー','ふーしょうふーめつ','ふーくーふーじょう','ふーぞうふーめつ',
    'ぜーこくうちゅうむーしき','むーじゅうそうぎょうしき','むーげんにーびーぜっしんに','むーしきしょうこうみーそくほー',
    'むーげんかいないしー','むーいしきーかい','むーむーみょう','やくむーむーみょうじん','ないしーむーろーしー',
    'やくむーろーしーじん','むーくーしゅうめつどー','むーちーやくむーとく','いーむーしょーとくこー',
    'ぼーだいさったー','えーはんにゃー','はーらーみーたーこー','しんむーけーげー','むーけーげーこー','むうくう',
    'おんりーいっさい','てんどうーむーそー','くーぎょうーねーはん','さんぜーしょーぶつ','えーはんにゃー','はーらーみーたーこー',
    'とくあーのくたーらー','さんみゃくさんぼーだい','こーちはんにゃー','はーらーみーた',
    'ぜーだいじんしゅ','ぜーだいみょーしゅ','ぜーむーじょうしゅ','ぜーむーとうどうしゅ',
    'のうじょーいっさいく','しんじつぶーこー','こーせつはんにゃー','はーらーみーたー',
    'しゅーそくせつしゅーわつ','ぎゃーてーぎゃーてー','はーらーぎゃーてー','はらそうぎゃーてー','ぼーじーそわかー',
    'はんにゃーし～んぎょう～']
let currentAnimalIndex = -1;
{
    const btn = document.getElementById('btn');

    btn.addEventListener('click', () =>{
        currentAnimalIndex = (currentAnimalIndex + 1)% shingyou.length;
        btn.textContent = shingyou[currentAnimalIndex];
    });
}
